

class SchoolDic(object):
    dic={}
    def __init__(self):
        self.dic={
            "北京航空航天大学":["北航"],
            "北京外国语大学":["北外"],
            "上海交通大学":["上海交大"],
            "华东师范大学": ["华东师大"],
            "上海财经大学": ["上海财经"],
            "华东理工大学":["华东理工"],
            "上海外国语大学":["上海外国语"],
            "第二军医大学":["第二军医"],
            "华东政法大学":["华东政法"],
            "上海理工大学":["上海理工"],
            "上海海事大学":["上海海事"],
            "上海师范大学": ["上海师大"],
            "上海体育学院": ["上海体院"],
            "上海中医药大学":["上海中医药"],
            "华北电力大学": ["华电保定"],
            "河北工大大学": ["河北工大"],
            "太原理工大学": ["太原理工"],
            "天津财经":["天津财经"],
            "天津师范大学":["天津师大"],
            "天津外国语大学":["天津外国语"],
            "天津科技大学": ["天津科大"],
            "天津工业大学": ["天津工大"],
            "河北师范大学": ["河北师大"],
            "河北医科大学": ["河北医科"],
            "大连理工大学": ["大连理工"],
            "大连海事大学": ["大连海事"],
            "哈尔滨工业大学": ["哈工大"],
            "东北师范大学": ["东北师大"],
            "哈尔滨工程大学": ["哈工程"],
            "东北农业大学": ["东北农大"],
            "东北林业大学": ["东北林大"],
            "东北财经大学": ["东北财经"],
            "辽宁师范大学": ["辽宁师大"],
            "沈阳工业大学": ["沈阳工业"],
            "辽宁工程大学": ["辽宁工程"],
            "沈阳师范大学": ["沈阳师范"],
            "中国海洋大学": ["中国海洋"],
            "中国石油大学": ["中国石油"],
            "南京航空航天大学": ["南航"],
            "南京农业大学": ["南京农业"],
            "南京师范大学": ["南京师范"],
            "中国药科大学": ["中国药科"],
            "南京理工大学": ["南京理工"],
            "中国矿业大学": ["中国矿业"],
            "西安交通大学": ["西安交大"],
            "西安电子科技大学": ["西安电子科大"],
            "陕西师范大学": ["陕西师大"],
            "西北工业大学": ["西北工业"],
            "西北农林大学": ["西北农林"],
            "第四军医大学": ["第四军医"],
            "西安建筑科技大学": ["西安建科"],
            "西安理工大学": ["西安理工"],
            "西安科技大学": ["西安科技"],
            "西南财经大学": ["西南财经"],
            "电子科技大学": ["电子科大"],
            "西南交通大学": ["西南交大"],
            "成都理工大学": ["成都理工"],
            "四川师范大学": ["四川师范"],
            "四川农业大学": ["四川农业"],
            "成都中医药大学": ["成都中医药"],
            "重庆邮电大学": ["重庆邮电"],
            "中央民族大学":["民大"]
        }

    def getSchool(self,name):
        name=name.replace(' ','')
        if name.find('大学')>=0:
            return name
        for d in self.dic:
            for k in self.dic[d]:
                if k==name:
                    return d
        return name

    def getJian(self,name):
        try:
            return self.dic[name]
        except:
            return [name]
